Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/housing_grants_and_schemes/warmer_homes_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Better Energy Warmer Homes Scheme
ga: An Scéim ‘Fuinneamh Níos Fearr, Tithe Níos Teo’

source: • How does it work?
ga: • Conas a oibríonn an scéim?

source: The Better Energy Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people on low incomes
ga: Tá sé mar chuspóir ag an scéim ‘Fuinneamh Níos Fearr, Tithe Níos Teo’ feabhas a chur ar éifeachtúlacht fuinnimh agus ar theas tithe atá faoi úinéireacht daoine ag a bhfuil ioncaim ísle

source: It is operated by the Sustainable Energy Authority of Ireland (SEAI) and replaces the earlier Warmer Homes Scheme
ga: Tá an scéim á hoibriú ag Údarás Fuinnimh Inmharthana na hÉireann (SEAI) agus cuirtear í in ionad na Scéime ‘Tithe Níos Teo’ a bhí á hoibriú níos luaithe

source: Full details of the scheme are on the SEAI’s website and further useful information is on the Keeping Well and Warm website
ga: Tá teacht ar shonraí iomlána faoin scéim seo ar láithreán gréasáin an SEAI agus tá fáil ar bhreis faisnéise ar an láithreán gréasáin Coimeád Folláin agus Te ‘Keeping Well and Warm’

source: How does it work?
ga: Conas a oibríonn an scéim?

source: The work funded under the Better Energy Warmer Homes Scheme includes:
ga: I measc na hoibre a chistítear faoin Scéim ‘Fuinneamh Níos Fearr, Tithe Níos Teo’, tá:

source: The services are provided by a panel of non-profit community-based organisations and a panel of private contractors. Both panels are appointed by SEAI
ga: Cuireann painéal eagraíochtaí neamhbhrabacha pobalbhunaithe agus painéal conraitheoirí príobháideacha na seirbhísí ar fáil

source: The work is then done by an installer, if budget is available
ga: Déanann an SEAI an dá phainéal a cheapadh

source: Inspections are carried out on a sample of homes completed to ensure that standards are maintained
ga: Tugtar faoi imscrúduithe ar roinnt tithe inar cuireadh an obair chun críche lena chinntiú go gcoimeádtar na caighdeáin

source: The Environmental Protection Agency encourages anyone availing of this scheme to have their home tested for radon
ga: Spreagann an An Ghníomhaireacht um Chaomhnú Comhshaoil d’aon duine a fhaigheann fáil ar an scéim seo a theach a thástáil i leith radóin

source: If you are a homeowner (or purchasing your home):
ga: Más úinéir tí thú (nó má tá an teach á cheannach agat):

source: Your home must have been built before 2006 and you must be getting one of the following payments:
ga: Ní mór gur tógadh do theach roimh 2006 agus ní mór go bhfuil ceann de na híocaíochtaí a leanas á fáil agat:

source: • Fuel Allowance as part of the National Fuel Scheme
ga: • Liúntas Breosla mar chuid den Scéim Náisiúnta Breosla

source: • Jobseeker’s Allowance for over 6 months and have a child aged under 7 years
ga: • Liúntas Cuardaitheora Poist ar feadh breis agus 6 mhí agus leanbh faoi bhun 7 mbliana d’aois a bheith agat

source: If you are in private rented accommodation and at risk of energy poverty, your landlord may be able to get a grant under the separate Better Energy Homes Scheme
ga: Má tá cónaí ort i gcóiríocht phríobháideach ar cíos agus má tá baol tearcrochtain fuinnimh ort, d'fhéadfadh go mbeadh do thiarna talún in ann deontas a fháil faoin scéim ar leith, Scéim na dTithe le Fuinneamh Níos Fearr

source: There is no charge for work done under the Better Energy Warmer Homes Scheme
ga: Níl aon táille le híoc as obair a dhéantar faoin Scéim ‘Fuinneamh Níos Fearr, Tithe Níos Teo’

source: To apply directly for the scheme you can download the application form (pdf), contact SEAI by phone on 1800 250 204 or email warmerhomes@seai.ie
ga: Chun iarratas a dhéanamh díreach ar an scéim, déan teagmháil leis an SEAI ar an nguthán ag 1800 250 204 nó trí ríomhphost a sheoladh chuig warmerhomes@seai.ie

source: You can also use these contact details to order a copy of the booklet 'Keeping well and warm'
ga: Féadfaidh tú an leabhrán ‘Coimeád folláin agus te’ a ordú ar na bealaí céanna

source: Eligible homes may also be identified locally by networks or groups made up from both the statutory and voluntary sectors
ga: Ina theannta sin, féadtar tithe incháilithe a shainaithint go háitiúil trí líonraí nó grúpaí de na hearnálacha reachtúla agus deonacha araon
